parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
void configure_timer()
{
    Serial.println("Configuring Timers");
    update_oled("Setting", "Up", "Timer");
    solid_rgb_ring(RED_COLOR);
    timer = timerBegin(0, PRESCALAR, true);
    timerAttachInterrupt(timer, &onTime, true);
    timerAlarmWrite(timer, (ESP32_CLOCK / PRESCALAR), true);
    update_oled("Timer", "Setup", "Done");
    solid_rgb_ring(GREEN_COLOR);
    return;
}

void IRAM_ATTR onTime()
{
    count++;
}

void print_company_logo()
{
    Serial.println("Printing Company Logo");
    display.clearDisplay();
    display.drawBitmap(0, 0, COMPANY_LOGO, SCREEN_WIDTH, SCREEN_HEIGHT, WHITE);
    display.display();
    solid_rgb_ring(BLUE_COLOR);
}

int printLocalTime()
{
    update_oled("Updating", "NTP", "");
    Serial.println("Fetching Latest Time from NTP");
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo))
    {
        update_oled("NTP", "Update", "Failed");
        solid_rgb_ring(GREEN_COLOR);
        rtc_get_time();
        return EXIT_FAILURE;
    }
    year = timeinfo.tm_year - 100;
    month = timeinfo.tm_mon + 1;
    date = timeinfo.tm_mday;
    hour = timeinfo.tm_hour;
    minutes = timeinfo.tm_min;
    seconds = timeinfo.tm_sec;
    update_oled("NTP", "Update", "Success");
    Serial.println("Time from NTP:\n" + (String)year + '/' + (String)month + '/' + (String)date + '\n' + (String)hour + ':' + (String)minutes + ':' + (String)seconds);
    update_oled("RTC", "Updating", "");
    rtc.adjust(DateTime(year, month, date, hour, minutes, seconds));
    update_oled("RTC", "Updated", "");
    return EXIT_SUCCESS;
}

void wifi_ntp_setup(void)
{
    //connect to WiFi
    Serial.println("Setting up WiFi and NTP");
    update_oled("Wifi", "Connecting", ssid);
    solid_rgb_ring(RED_COLOR);
    WiFi.begin(ssid, password);
    while (WiFi.status() != WL_CONNECTED)
    {
        delay(50);
        Serial.print(".");
    }
    Serial.println("CONNECTED");
    update_oled("Wifi", "Connected", ssid);
    delay(1000);
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
    solid_rgb_ring(GREEN_COLOR);
    rtc_setup();
    printLocalTime();
}

void rtc_setup()
{
    update_oled("RTC", "Connecting", "");
    Serial.println("Setting up RTC");
    solid_rgb_ring(RED_COLOR);
    if (!rtc.begin())
    {
        Serial.println("Couldn't find RTC");
        while (1)
            ;
    }
    Serial.println("RTC Setup Donw");
    update_oled("RTC", "Setup", "Done");
    solid_rgb_ring(GREEN_COLOR);
}

void rtc_get_time()
{
    Serial.println("Fetching Time from RTC");
    update_oled("RTC", "Updating", "");
    solid_rgb_ring(RED_COLOR);
    DateTime now = rtc.now();
    Serial.println("RTC Update Successful");
    year = now.year();
    month = now.month();
    seconds = now.second();
    hour = now.hour();
    minutes = now.minute();
    seconds = now.second();
    Serial.println("Time from RTC:\n" + (String)year + '/' + (String)month + '/' + (String)date + '\n' + (String)hour + ':' + (String)minutes + ':' + (String)seconds);
    update_oled("NTP", "Updated", "");
    solid_rgb_ring(GREEN_COLOR);
}

void oled_setup()
{
    Serial.println("Setting up OLED");
    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C))
    {
        Serial.println(F("SSD1306 allocation failed"));
        for (;;)
            ; // Don't proceed, loop forever
    }
    display.clearDisplay();
    print_company_logo();
    solid_rgb_ring(RED_COLOR);
    solid_rgb_ring(YELLOW_COLOR);
    solid_rgb_ring(GREEN_COLOR);
    solid_rgb_ring(BLUE_COLOR);
}

void update_oled(String text1, String text2, String text3)
{
    Serial.println("Updating OLED to:\n" + text1 + '\n' + text2 + '\n' + text3);
    display.clearDisplay();
    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);
    display.setCursor(0, 0);
    display.println(text1);
    display.setCursor(0, SCREEN_HEIGHT / 3);
    display.println(text2);
    display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
    display.println(text3);
    display.display();
}

void oled_menu_update(String item1, String item2, String item3)
{
    display.clearDisplay();

    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);
    display.setCursor(0, 0);
    display.println("-");
    display.setCursor(15, 0);
    display.println(item1);
    display.setCursor(15, SCREEN_HEIGHT / 3);
    display.println(item2);
    display.setCursor(15, 2 * SCREEN_HEIGHT / 3);
    display.println(item3);

    display.display();
}

void write_radio(char transmission_address[], String transmission_message)
{
    update_oled("Sending", "Message", "via NRF");
    byte address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = transmission_address[i];
    }
    radio.openWritingPipe(address);
    radio.setPALevel(RF24_PA_MIN);
    radio.stopListening();
    delay(100);
    radio.write(&transmission_message, sizeof(transmission_message));
    delay(500);
}

String read_radio(char recieving_address[])
{
    update_oled("Recieving", "Message", "via NRF");
    byte address[COMMUNICATION_ID_LENGTH];
    for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = recieving_address[i];
    }
    radio.openReadingPipe(0, address);
    radio.setPALevel(RF24_PA_MIN);
    radio.startListening();
    delay(100);
    String recieved_message = "";
    if (radio.available())
    {
        update_oled("Recieved", "Message", "via NRF");
        radio.read(&recieved_message, sizeof(recieved_message));
    }
    else
    {
        update_oled("Failed", "Message", "via NRF");
    }
    delay(100);
    return recieved_message;
}

void createDir(fs::FS &fs, const char *path)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Creating", "Dir. in", "MicroSD");
    Serial.printf("Creating Dir: %s\n", path);
    if (fs.mkdir(path))
    {
        Serial.println("Dir created");
    }
    else
    {
        Serial.println("mkdir failed");
    }
    solid_rgb_ring(GREEN_COLOR);
}

int readFile(fs::FS &fs, const char *path)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Reading", "File from", "MicroSD");
    Serial.printf("Reading file: %s\n", path);

    File file = fs.open(path);
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        return EXIT_FAILURE;
    }

    Serial.print("Read from file: ");
    while (file.available())
    {
        Serial.write(file.read());
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
    return EXIT_SUCCESS;
}

void writeFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Writinging", "File to", "MicroSD");
    Serial.printf("Writing file: %s\n", path);

    File file = fs.open(path, FILE_WRITE);
    if (!file)
    {
        Serial.println("Failed to open file for writing");
        return;
    }
    if (file.print(message))
    {
        Serial.println("File written");
    }
    else
    {
        Serial.println("Write failed");
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
}

void appendFile(fs::FS &fs, const char *path, const char *message)
{
    update_oled("Appending", "File to", "MicroSD");
    solid_rgb_ring(RED_COLOR);
    Serial.printf("Appending to file: %s\n", path);

    File file = fs.open(path, FILE_APPEND);
    if (!file)
    {
        Serial.println("Failed to open file for appending");
        writeFile(SD, path, message);
        return;
    }
    if (file.print(message))
    {
        Serial.println("Message appended");
    }
    else
    {
        Serial.println("Append failed");
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
}

void sd_setup()
{
    update_oled("Setting", "up", "MicroSD");
    Serial.println("Setting up SD Card");
    solid_rgb_ring(RED_COLOR);
    if (!SD.begin(SD_CS))
    {
        Serial.println("Card Mount Failed");
        update_oled("MicroSD", "Mount", "Failed");
        return;
    }
    update_oled("MicroSD", "Setup", "Done");
    solid_rgb_ring(GREEN_COLOR);
}

void read_rotary_encoder()
{
    Serial.println("Enabling Rotary Encoder");
    //TODO Pause all timers
    update_oled("Starting", "to read", "Rotary Enc.");
    String item1, item2, item3;
    int main_list_pos = 0;
    int sub_list_pos = 0;
    int menu_level = 1;
    int menu_item = 0;
    int menu_length = MAIN_MENU_LIST;
    oled_menu_update(main_menu[0][0][0], main_menu[1][0][0], main_menu[2][0][0]);
    aLastState = digitalRead(outputA);
    while (1)
    {
        item1 = "";
        item2 = "";
        item3 = "";
        aState = digitalRead(outputA); // Reads the "current" state of the outputA
        if (aState != aLastState)      // If the previous and the current state of the outputA are different, that means a Pulse has occured
        {
            if (digitalRead(outputB) != aState) // If the outputB state is different to the outputA state, that means the encoder is rotating clockwise
            {
                counter += 0.5;
            }
            else
            {
                counter -= 0.5;
            }

