parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
            if ((int)counter >= menu_length - 1)
            {
                counter = menu_length - 1;
            }
            else if ((int)counter < 0)
            {
                counter = 0;
            }

            if (menu_level == 1)
            {
                menu_length = MAIN_MENU_LIST;
                main_list_pos = (int)counter;
                item1 = main_menu[main_list_pos][0][0];

                if (main_list_pos < (menu_length - 1))
                {
                    item2 = main_menu[main_list_pos + 1][0][0];
                }

                if (main_list_pos < menu_length - 2)
                {
                    item3 = main_menu[main_list_pos + 2][0][0];
                }
                menu_item = 10 * (int)counter;
            }

            else if (menu_level == 2)
            {
                sub_list_pos = (int)counter;
                item1 = main_menu[main_list_pos][1][sub_list_pos];

                if (sub_list_pos < (menu_length - 1))
                {
                    item2 = main_menu[main_list_pos][1][sub_list_pos + 1];
                }

                if (sub_list_pos < (menu_length - 2))
                {
                    item3 = main_menu[main_list_pos][1][sub_list_pos + 2];
                }
                menu_item += (int)counter;
            }
            oled_menu_update(item1, item2, item3);
            aLastState = aState; // Updates the previous state of the outputA with the current state
        }
        if (digitalRead(outputS) == HIGH)
        {
            delay(500);
            if ((int)counter == 0)
            {
                main_list_pos = 0;
                oled_menu_update(main_menu[0][0][0], main_menu[1][0][0], main_menu[2][0][0]);
                counter = 0;
                if (menu_level == 1)
                {
                    break;
                }
                else if (menu_level == 2)
                {
                    menu_level = 1;
                }
            }
            else
            {
                menu_length = SUB_MENU_LIST;
                oled_menu_update(main_menu[(int)counter][1][0], main_menu[(int)counter][1][1], main_menu[(int)counter][1][2]);
                counter = 0;
                menu_level++;
                Serial.println(menu_level);
            }
            delay(500);
        }
    }
    solid_rgb_ring(BLUE_COLOR);
}

void solid_rgb_ring(uint32_t color)
{
    Serial.println("Setting up RGB Color");
    pixels.clear();
    for (size_t i = 0; i < NUMPIXELS; i++)
    {
        pixels.setPixelColor(i, color);
    }
    pixels.show();
}

void halt_rgb_ring(int led_number)
{
    pixels.clear();
    led_number = led_number % NUMPIXELS;
    pixels.setPixelColor(led_number, YELLOW_COLOR);
    pixels.show();
}

void pin_setup()
{
    pinMode(outputA, INPUT);
    pinMode(outputB, INPUT);
    pinMode(outputS, INPUT);
}

void rgb_ring_setup()
{
    Serial.println("Setting up RGB Ring");
    pixels.begin();
    pixels.setBrightness(BRIGHTNESS * 255 / 100);
}

void read_box_details_from_sd_card()
{
    Serial.println("Reading Box Details from SD Card");
    RL.readLines(BOX_ID_DETAILS_FILE, &handleEachLine);
    Serial.println("File Read Complete");
}

void handleEachLine(char line[], int lineIndex)
{
    char box_id[BOX_ID_LENGTH];
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = line[i];
        }
        else
        {
            address[i - BOX_ID_LENGTH] = line[i];
        }
    }
    BOX_DETAILS[lineIndex][0] = (String)box_id;
    BOX_DETAILS[lineIndex][1] = (String)address;
    Serial.println("Box ID: " + BOX_DETAILS[lineIndex][0] + '\n' + "Box Address" + BOX_DETAILS[lineIndex][1]);
}

String fetch_box_address(String box_id)
{
    int i;
    for (i = 0; i < connected_boxes; i++)
    {
        String box = BOX_DETAILS[i][0];
        if (box == box_id)
        {
            break;
        }
    }
    String address = BOX_DETAILS[i][1];
    return address;
}

void regular_box_update(void)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    Serial.println("");
    update_oled("Timer", "Activated", "");
    solid_rgb_ring(pixels.Color(125, 125, 125));
    delay(10000);
    // rtc_get_time();
    // connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
    // for (int i = 0; i < connected_boxes; i++)
    // {
    //     halt_rgb_ring(i);
    //     String box_id = BOX_DETAILS[i][0];
    //     String address = BOX_DETAILS[i][1];
    //     update_oled("Contacting", "Box", box_id);
    //     update_box_data(box_id, address);
    // }
    timerStart(timer);
    timerAlarmEnable(timer);
}

void add_new_box(String box_id)
{
    update_oled("Adding", "New Box", box_id);
    srand(time(0));
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = alphabet[rand() % (AVAILABLE_CHARACTERS - 1)];
    }

    String message = "pair," + box_id + "," + (String)address;
    write_radio(BROADCAST_RECIEVER_ADDRESS, message);

    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    if (recieved_message = ("pair,ok," + (String)box_id))
    {
        connection_status = 1;
        connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
        connected_boxes++;
        EEPROM.write(CONNECTED_BOXES_STORED_LOCATION, connected_boxes);
        EEPROM.commit();
        char sd_message[BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH];
        for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH); i++)
        {
            if (i < BOX_ID_LENGTH)
            {
                sd_message[i] = box_id[i];
            }
            else
            {
                sd_message[i] = address[i - BOX_ID_LENGTH];
            }
        }
        appendFile(SD, BOX_ID_DETAILS_FILE, sd_message);
        read_box_details_from_sd_card();
        update_oled("Added", "New Box", box_id);
    }
    else
    {
        update_oled("Failed", "New Box", box_id);
    }
    if (!client.connected())
    {
        checkWiFiThenMQTT();
    }
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "add", connection_status, (String)address, "");
    }
}

