parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
void calibrate_box(String box_id, String box_address)
{
    update_oled("Calibrating", "Box", box_id);
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = box_address[i];
    }

    String message = "cali";
    write_radio(address, message);

    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    if (recieved_message = ("cali,ok"))
    {
        connection_status = 1;
    }
    if (!client.connected())
    {
        checkWiFiThenMQTT();
    }
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "calibrate", connection_status, "", "");
    }
    delay(30 * 1000);

    write_radio(address, "calibration_data_update");
    String update_message = read_radio(address);
    if (update_message != "")
    {
        update_oled("Calibration", "Successful", box_id);
        if (!client.connected())
        {
            checkWiFiThenMQTT();
        }
        else
        {
            client.loop();
            send_Success_Data((String)box_id, "calibration_update", connection_status, update_message, "");
        }
    }
}

void update_box_data(String box_id, String box_address)
{
    update_oled("Detching", "Update", box_id);
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = box_address[i];
    }

    String write_message = "updt";
    write_radio(address, write_message);

    String message = read_radio(address);
    if (message != "")
    {
        String str_sd_message = box_id + message;
        int msg_size = sizeof(str_sd_message) / sizeof(str_sd_message[0]);
        char sd_message[msg_size];
        for (int i = 0; i < msg_size; i++)
        {
            sd_message[i] = str_sd_message[i];
        }

        String str_dir = (String)year + (String)month;
        int dir_size = sizeof(str_dir) / sizeof(str_dir[0]);
        char dir[dir_size];
        for (int i = 0; i < dir_size; i++)
        {
            dir[i] = str_dir[i];
        }
        createDir(SD, dir);

        String str_file_path = (String)year + (String)month + (String)date + file_extension;
        int path_size = sizeof(str_file_path) / sizeof(str_file_path[0]);
        char file_path[path_size];
        for (int i = 0; i < path_size; i++)
        {
            file_path[i] = str_file_path[i];
        }
        appendFile(SD, file_path, sd_message);

        if (!client.connected())
        {
            checkWiFiThenMQTT();
        }
        else
        {
            client.loop();
            sendData(box_id, message);
        }
    }
}

void change_box_setting(String box_id, String box_address, String dt, String st, String bt)
{
    update_oled("Change", "Setting", box_id);
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = box_address[i];
    }
    String message = "chng," + dt + st + bt;
    write_radio(address, message);
    int success_code = 0;
    String recieved_message = read_radio(address);
    if (recieved_message == "chng,ok")
    {
        success_code = 1;
        update_oled("Setting", "Successful", box_id);
    }
    else
    {
        update_oled("Setting", "Failed", box_id);
    }
    if (!client.connected())
    {
        checkWiFiThenMQTT();
    }
    else
    {
        client.loop();
        send_Success_Data(box_id, "change", success_code, st, bt);
    }
}

void sound_buzzer(String box_id)
{
    update_oled("Buzz", "Box", box_id);
    String box_address = fetch_box_address(box_id);
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = box_address[i];
    }
    String message = "buzz";
    write_radio(address, message);
}

void aws_setup()
{
    update_oled("AWS", "Setup", "In Progress");
    Serial.println("Setting up AWS");
    solid_rgb_ring(RED_COLOR);
    net.setCACert(cacert);
    net.setCertificate(client_cert);
    net.setPrivateKey(privkey);
    client.begin(MQTT_HOST, MQTT_PORT, net);
    client.onMessage(messageReceived);
    connectToMqtt(false);
    update_oled("AWS", "Setup", "Complete");
    solid_rgb_ring(GREEN_COLOR);
}

void messageReceived(String &topic, String &payload)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    //Reference: https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonParserExample/JsonParserExample.ino
    update_oled("Message", "Recieved", "from AWS");
    solid_rgb_ring(YELLOW_COLOR);
    Serial.println("Recieved [" + topic + "]: " + payload);
    StaticJsonDocument<50> doc;
    DeserializationError error = deserializeJson(doc, payload);
    if (error)
    {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        return;
    }
    String box_id = doc["boxid"];
    String cmd = doc["cmd"];

    // Perform action as per the command from AWS
    if (cmd == "add") // Add new Box
    {
        add_new_box(box_id);
    }
    else if (cmd == "calibrate") //Calibrate box parameters
    {
        String address = fetch_box_address(box_id);
        calibrate_box(box_id, address);
    }
    else if (cmd == "ask") //Ask box for updated values
    {
        rtc_get_time();
        String address = fetch_box_address(box_id);
        update_box_data(box_id, address);
    }
    else if (cmd == "change_setting") // Change box settings
    {
        String dt = doc["dt"];
        String st = doc["st"];
        String bt = doc["bt"];
        String address = fetch_box_address(box_id);
        change_box_setting(box_id, address, dt, st, bt);
    }
    else if (cmd == "buzz")
    {
        sound_buzzer(box_id);
    }
    solid_rgb_ring(GREEN_COLOR);
    timerStart(timer);
    timerAlarmEnable(timer);
}

void lwMQTTErr(lwmqtt_err_t reason)
{
    if (reason == lwmqtt_err_t::LWMQTT_SUCCESS)
        Serial.print("Success");
    else if (reason == lwmqtt_err_t::LWMQTT_BUFFER_TOO_SHORT)
        Serial.print("Buffer too short");
    else if (reason == lwmqtt_err_t::LWMQTT_VARNUM_OVERFLOW)
        Serial.print("Varnum overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_CONNECT)
        Serial.print("Network failed connect");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_TIMEOUT)
        Serial.print("Network timeout");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_READ)
        Serial.print("Network failed read");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_WRITE)
        Serial.print("Network failed write");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_OVERFLOW)
        Serial.print("Remaining length overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_MISMATCH)
        Serial.print("Remaining length mismatch");
    else if (reason == lwmqtt_err_t::LWMQTT_MISSING_OR_WRONG_PACKET)
        Serial.print("Missing or wrong packet");
    else if (reason == lwmqtt_err_t::LWMQTT_CONNECTION_DENIED)
        Serial.print("Connection denied");
    else if (reason == lwmqtt_err_t::LWMQTT_FAILED_SUBSCRIPTION)
        Serial.print("Failed subscription");
    else if (reason == lwmqtt_err_t::LWMQTT_SUBACK_ARRAY_OVERFLOW)
        Serial.print("Suback array overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_PONG_TIMEOUT)
        Serial.print("Pong timeout");
}

void lwMQTTErrConnection(lwmqtt_return_code_t reason)
{
    if (reason == lwmqtt_return_code_t::LWMQTT_CONNECTION_ACCEPTED)
        Serial.print("Connection Accepted");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNACCEPTABLE_PROTOCOL)
        Serial.print("Unacceptable Protocol");
    else if (reason == lwmqtt_return_code_t::LWMQTT_IDENTIFIER_REJECTED)
        Serial.print("Identifier Rejected");
    else if (reason == lwmqtt_return_code_t::LWMQTT_SERVER_UNAVAILABLE)
        Serial.print("Server Unavailable");
    else if (reason == lwmqtt_return_code_t::LWMQTT_BAD_USERNAME_OR_PASSWORD)
        Serial.print("Bad UserName/Password");
    else if (reason == lwmqtt_return_code_t::LWMQTT_NOT_AUTHORIZED)
        Serial.print("Not Authorized");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNKNOWN_RETURN_CODE)
        Serial.print("Unknown Return Code");
}

void connectToMqtt(bool nonBlocking)
{
    Serial.print("MQTT connecting ");
    while (!client.connected())
    {
        if (client.connect(THINGNAME))
        {
            Serial.println("connected!");
            if (!client.subscribe(MQTT_SUB_TOPIC))
                lwMQTTErr(client.lastError());
        }
        else
        {
            Serial.print("SSL Error Code: ");
            //  Serial.println(net.getLastSSLError());
            Serial.print("failed, reason -> ");
            lwMQTTErrConnection(client.returnCode());
            if (!nonBlocking)
            {
                Serial.println(" < try again in 5 seconds");
                delay(5000);
            }
            else
            {
                Serial.println(" <");
            }
        }
        if (nonBlocking)
            break;
    }
}

void connectToWiFi(String init_str)
{
    if (init_str != emptyString)
        Serial.print(init_str);
    while (WiFi.status() != WL_CONNECTED)
    {
        Serial.print(".");
        delay(1000);
    }
    if (init_str != emptyString)
        Serial.println("ok!");
}

void checkWiFiThenMQTT(void)
{
    connectToWiFi("Checking WiFi");
    connectToMqtt(false);
}

