parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
unsigned long previousMillis = 0;
const long interval = 5000;

void checkWiFiThenMQTTNonBlocking(void)
{
    connectToWiFi(emptyString);
    if (millis() - previousMillis >= interval && !client.connected())
    {
        previousMillis = millis();
        connectToMqtt(true);
    }
}

void checkWiFiThenReboot(void)
{
    connectToWiFi("Checking WiFi");
    Serial.print("Rebooting");
    ESP.restart();
}

void send_Success_Data(String box_id, String command, int success_status, String param1, String param2)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    update_oled("AWS", "Upload", "InProgess");
    StaticJsonDocument<50> doc;
    doc["Box ID"] = box_id;
    doc["cmd"] = command;
    doc["success"] = success_status;
    if (command == "add")
    {
        doc["Box Address"] = param1;
    }
    else if (command == "calibration_update")
    {
        doc["Calibration Data"] = param1;
    }
    else if (command = "change")
    {
        doc["st"] = param1;
        doc["bt"] = param2;
    }
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
    {
        update_oled("AWS", command, "Success");
    }
}

void sendData(String box_id, String message)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    char token = ',';
    char params[UPDATE_PARAMETERS][10] = {{}, {}, {}, {}, {}};
    int j = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (message[i] != token)
        {
            params[j][i % 10] = message[i];
        }
        else
        {
            j++;
        }
    }
    String c = (String)params[0]; //Count
    String t = (String)params[1]; //Temperature
    String b = (String)params[2]; //Battery
    String o = (String)params[3]; //Offset
    String a = (String)params[4]; //Average Weight

    StaticJsonDocument<50> doc;
    doc["time"] = (char)year + '/' + (char)month + '/' + (char)date + ' ' + (char)hour + ':' + (char)minutes + ':' + (char)seconds;
    doc["cmd"] = "ask";
    doc["c"] = c;
    doc["t"] = t;
    doc["b"] = b;
    doc["o"] = o;
    doc["a"] = a;
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
    {
        update_oled("AWS", "update", "Success");
    }
}

void setup()
{
    Serial.begin(115200);
    rgb_ring_setup();
    oled_setup();
    radio.begin();
    EEPROM.begin(EEPROM_SIZE);
    pin_setup();
    // wifi_ntp_setup();
    // aws_setup();
    // sd_setup();
    // read_box_details_from_sd_card();
    // if (BOX_DETAILS[0][0] == NULL)
    // {
    //     update_oled("No", "Box", "Linked");
    //     Serial.println("No Box Linked");
    //     solid_rgb_ring(RED_COLOR);
    //     while (BOX_DETAILS[0][0] == NULL)
    //     {
    //     }
    // }
    configure_timer();
    timerAlarmEnable(timer);
    print_company_logo();
}

void loop()
{

    if (digitalRead(outputS) == HIGH)
    {
        timerStop(timer);
        timerAlarmDisable(timer);
        delay(DEBOUNCE_TIME);
        if (digitalRead(outputS) == HIGH)
        {
            delay(500);
            read_rotary_encoder();
            print_company_logo();
        }
        delay(1000);
        timerStart(timer);
        timerAlarmEnable(timer);
    }
    if (count > TIMER)
    {
        count = 0;
        regular_box_update();
        print_company_logo();
    }
}
